In [3]:
# magic command to display matplotlib plots inline within the ipython notebook webpage
%matplotlib inline

# import necessary modules
import pandas as pd, numpy as np, matplotlib.pyplot as plt
# create a pandas dataframe from the location data set
df = pd.read_csv('data/summer-travel-gps-full.csv')
df.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [58]:
df.tail()

            lat        lon              date    city  country
1754  48.356013  11.791710  07/09/2014 13:13  Munich  Germany
1755  48.356529  11.792183  07/09/2014 13:14  Munich  Germany
1756  48.356285  11.791710  07/09/2014 13:17  Munich  Germany
1757  48.355328  11.791710  07/09/2014 13:18  Munich  Germany
1758  48.357110  11.791346  07/09/2014 13:20  Munich  Germany

In [5]:
# Q1: how to get 2 columns from the dataframe (city and country)?
print(df[['city','country']].head()) #first 5 rowns of 2 selected column

           city         country
0  West Drayton  United Kingdom
1      Hounslow  United Kingdom
2      Hounslow  United Kingdom
3      Hounslow  United Kingdom
4      Hounslow  United Kingdom

In [6]:
# Q2: how to get the first 5 rows of the "city" column?
print(df['city'].head())

0    West Drayton
1        Hounslow
2        Hounslow
3        Hounslow
4        Hounslow
Name: city, dtype: object

In [23]:
# Q3: how to use .loc to select the third row of the dataframe?
print(df.loc[2]) #get 3rd row/index

lat               51.478199
lon               -0.446081
date       05/14/2014 10:51
city               Hounslow
country      United Kingdom
Name: 2, dtype: object

In [8]:
# Q4: how to use .loc to select the first row in "country" column?
print(df['city'].loc[0]) #1st row of the city column

West Drayton

In [22]:
# Q5: how to select the first 4 rows of ['city', 'date'] columns?
print(df[['city', 'date']].loc[0:3])

           city              date
0  West Drayton  05/14/2014 09:07
1      Hounslow  05/14/2014 09:22
2      Hounslow  05/14/2014 10:51
3      Hounslow  05/14/2014 11:24

In [10]:
# use .iloc for integer position based indexing
# Q6: how to get the value from the row in position 3 and the column in position 2
print(df.iloc[[0], [1]]) #index 2 (position 3), column 2

        lon
0 -0.451011

In [11]:
# Q7: how to use iloc to select every 300th row from a data set
lngth = len(df)
print(df.iloc[0:lngth:300]) # get every 300th entry

            lat        lon              date          city         country
0     51.481292  -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
300   41.377091   2.151175  05/20/2014 03:18     Barcelona           Spain
600   50.052338  19.946220  05/31/2014 21:10        Krakow          Poland
900   48.561181   9.059672  06/09/2014 15:12      TÃ¼bingen         Germany
1200  41.378301   2.187443  06/17/2014 16:37     Barcelona           Spain
1500  42.208201  20.735993  06/30/2014 08:27       Prizren          Kosovo

In [67]:
# Q9: create a Series of true/false, indicating if each "city" row in the column is equal to "Munich"
temp_df = df
temp_df['isMunich'] = (temp_df['city'] == 'Munich') ## set new column to boolean depednatn on city name as munich
temp_df.loc[(temp_df['city'] == 'Munich')] # check if munich is marked as true

            lat        lon              date    city  country  isMunich
1753  48.356417  11.792155  07/09/2014 13:11  Munich  Germany      True
1754  48.356013  11.791710  07/09/2014 13:13  Munich  Germany      True
1755  48.356529  11.792183  07/09/2014 13:14  Munich  Germany      True
1756  48.356285  11.791710  07/09/2014 13:17  Munich  Germany      True
1757  48.355328  11.791710  07/09/2014 13:18  Munich  Germany      True
1758  48.357110  11.791346  07/09/2014 13:20  Munich  Germany      True

In [12]:
# pandas logical operators are: | for or, & for and, ~ for not
# these must be grouped by using parentheses
# Q10: what cities were visited in spain that were not barcelona? Create a dataframe for it.

In [13]:
# Q11: select rows where either the city is munich, or the country is serbia

In [14]:
# Q12: how many observations are west of the prime meridian?

In [15]:
# Q13: get all rows that contain a city that starts with the letter G

In [16]:
# Q14: how many unique cities and countries in the dataset? 
# Also can you check missing values for the dataframe

In [17]:
# Q15: group by country name and show the city names in each of the country

In [18]:
# load the location data set, indexed by the date field
# and, parse the dates so they're no longer strings but now rather Python datetime objects
# this lets us do date and time based operations on the data set
dt = pd.read_csv('data/summer-travel-gps-full.csv', index_col='date', parse_dates=True)
dt.head()

                           lat       lon          city         country
date
2014-05-14 09:07:00  51.481292 -0.451011  West Drayton  United Kingdom
2014-05-14 09:22:00  51.474005 -0.450999      Hounslow  United Kingdom
2014-05-14 10:51:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:24:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:38:00  51.474146 -0.451562      Hounslow  United Kingdom

In [19]:
# Q16: is the timestamp index unique? How can you use code to find it?

In [20]:
# Q17: drop duplicate index

In [21]:
# Q18: create a weekday and a weekend dataframe

In [ ]:
# Q19: calculate and plot the number of observations each day of the week has